# YOLOv8m + CBAM Attention for Bump Detection
# CBAM inserted after each C2f block in backbone for enhanced feature attention

# Parameters
nc: 2  # marked-speed-bump, non-marked-speed-bump
scales:
  m: [0.67, 0.75, 768]

# Backbone with CBAM attention
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]       # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, C2f, [256, True]]       # 4
  - [-1, 1, CBAM, [192]]            # 5  <- CBAM after P3 (192 = scaled 256 for m)
  - [-1, 1, Conv, [512, 3, 2]]      # 6-P4/16
  - [-1, 6, C2f, [512, True]]       # 7
  - [-1, 1, CBAM, [384]]            # 8  <- CBAM after P4 (384 = scaled 512 for m)
  - [-1, 1, Conv, [1024, 3, 2]]     # 9-P5/32
  - [-1, 3, C2f, [1024, True]]      # 10
  - [-1, 1, SPPF, [1024, 5]]        # 11
  - [-1, 1, CBAM, [576]]            # 12 <- CBAM after SPPF (576 = scaled 768 for m)

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 8], 1, Concat, [1]]       # 14 cat backbone P4 (CBAM at 8)
  - [-1, 3, C2f, [512]]             # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
  - [[-1, 5], 1, Concat, [1]]       # 17 cat backbone P3 (CBAM at 5)
  - [-1, 3, C2f, [256]]             # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]      # 19
  - [[-1, 15], 1, Concat, [1]]      # 20 cat head P4
  - [-1, 3, C2f, [512]]             # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]      # 22
  - [[-1, 12], 1, Concat, [1]]      # 23 cat head P5 (CBAM at 12)
  - [-1, 3, C2f, [1024]]            # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]]  # 25 Detect(P3, P4, P5)
